[
  {
    "path": "posts/2021-02-25-cetaceans/",
    "title": "Cetaceans in the California Bight",
    "description": "A brief analysis using species distribution models from Aquamaps.",
    "author": [
      {
        "name": "Rachel Rhodes",
        "url": {}
      }
    ],
    "date": "2021-02-25",
    "categories": [],
    "contents": "\nThere are over 35 different species of cetaceans found in the Southern California Bight, an area that includes coastal Southern California and the Channel Islands. Some of the species found here include humpback whales, blue whales, common dolphin, Pacific white-sided dolphin and many more. The following explores cetaceans species richness in the area using a species distribution maps created by AquaMaps. These species distribution maps were modeled using large sets of occurrence data from GBIF and OBIS combined with estimates of environmental preferences including depth, water temperature, salinity, and primary productivity.\n\n\n\nImage from Ocean Conservation Society\nThe data from this analysis uses species distribtuion maps that have already been clipped to the extent of the Southern California Bight.\nRaw Data: Kaschner,K., Rius-Barile, J., Kesner-Reyes, K., Garilao, C., Kullander, S., Rees, T., & Froese, R. (2016). AquaMaps: Predicted range maps for aquatic species. www.aquamaps.org\nTo create a species richness map of all 35 species found in the Southern California Bight, I first had to create a raster stack of all the species distributions:\n\n\n\nFigure 1. Raster stack of all 35 species distribtuion from AquaMaps.\nNext, I reclassified these rasters to be binary precense/absence data using a threshold of probabilities of 0.6 or greater considered “present”.\n\n\n\nFigure 2. Raster stack of all 35 species distribution from AquaMaps reclassified as presence or absence data. The distribution shown in yellow indicates that species is not found within the Southern California Bight.\nThen, I combined these all into one raster using the sum function:\n\n\n\nFigure 3. Raster of species richness (species count) in the Southern California Bight with the highest number of species shown in green and the lowest shown in pink and white.\nLastly, I mapped this to look a little better using ‘naturalearths’ package to load a shape file of the California coast:\n\n\n\nFigure 4. Species richness of 35 cetaceans species in the Southern California Bight using probability of occurrence from AquaMaps with any probability of 0.6 and higher as presence data.\n\n\n\n",
    "preview": "posts/2021-02-25-cetaceans/images/ocs_cetacean_drawings.jpg",
    "last_modified": "2021-02-25T15:54:29-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-25-gndproject/",
    "title": "Green New Deal",
    "description": "A text analysis of Green New Deals.",
    "author": [
      {
        "name": "Rachel Rhodes",
        "url": {}
      }
    ],
    "date": "2021-02-25",
    "categories": [],
    "contents": "\nThe Green New Deal (GND) is a congressional resolution that focuses on addressing climate change and economic inequality by building a green economy, inclusive of all people, through a fair and just transition. Since the Green New Deal was introduced by Representative Alexandria Ocasio-Cortez of New York and Senator Edward J. Markey of Massachusetts, state and local governments have created their own New Deal policies. The following analysis explores of the most frequently used words in various Green New Deals, comparing the federal resolution with state-level Green New Deals from California and Maine.\nLinks to original text\nNational GND: The federal Green New Deal is a 14 page document from February 7, 2019. The original document can be found here\nCalifornia GND: The California Green New, Assembly Bill 1839, was a 9 page document proposed on January 6, 2020. However, in response to the pandemic the bill was amended in May and lawmakers turned the bill into a California COVID-19 Recovery Deal. This analysis will compare the Green New Deal bill prior to the amendments. The bill can be found here\nMaine GND: The Maine Green New Deal is a 6 page document enacted June 17, 2019. The original document can be found here\nFirst, lets compare how robust and lengthy each document is by comparing the overall word count.\nSome quick takeaways from Figure 1:\nThe Federal legislation has the largest word count Maine legislation has far less words in their GND than California and the National GND\n\n\n\nFigure 1. Total word count for Green New Deal legislation for California, National, and Maine.\nNext, let’s compare the most used words in each document. To do this, we must remove the common and less interesting words like the, and, of, etc. for each document.\n\n\n\nFigure 2. Wordcloud of the most used words in the National Green New Deal.\n\n\n\nFigure 3. Wordcloud of the most used words in the California Green New Deal.\n\n\n\nFigure 4. Wordcloud of the most used words in the Maine Green New Deal.\nSome interesting takeaways:\nMaineGND uses more words like “construction”, “power”, “school”, “facility”\nCalifornia GND uses more words like “public”, “climate”, “green”\nThe National GND uses more words like “bills”, “united”, “communities”\nNow, let’s look at the overall sentiments found in each document using the AFINN lexicon. The AFINN sentiment lexicon is a lit of terms that has been manually rated between -5 and +5 with negative scored indicating negative sentiments (anger, sadness, etc.) and positive scores indicating positive sentiments (joy, happy, etc.).\nOverall, we can see that Maine has far less words associated with negative sentiments (Figure 5). If we looked at the average sentiment score/value for each Green New Deal, we can see that overall Maine has the highest average sentiment score, followed by California (Figure 6).\n\n\n\nFigure 5. Overall sentiment of words found in the Green New Deals for California, National, and Maine using the AFINN lexicon that ranks words from -5 to +5.\n\n\n\nFigure 6. The mean sentiment score for Green New Deal’s for California, National, and Maine using the AFINN lexicon that ranks words from -5 to +5 depending on the sentiment associated with each word.\n\n\n\n",
    "preview": "posts/2021-02-25-gndproject/images/gnd_word.png",
    "last_modified": "2021-02-25T15:40:02-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-23-welcome/",
    "title": "Welcome",
    "description": "Well hey there all you cool cats and kittens, welcome to my very first blog post",
    "author": [
      {
        "name": "Rachel Rhodes",
        "url": {}
      }
    ],
    "date": "2021-01-23",
    "categories": [],
    "contents": "\nSome sample figures to how this show up:\n\n\n\n\n\n\n",
    "preview": "posts/2021-01-23-welcome/welcome_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-02-09T14:40:49-08:00",
    "input_file": {}
  }
]
